[{
  "id": "0",
  "name": "American Squirrel",
  "image": "https://upload.wikimedia.org/wikipedia/commons/c/c6/Tamiasciurus_hudsonicus_CT.jpg",
  "location": "North American Continent",
  "description": "Red squirrels can be easily distinguished from other North American tree squirrels by their smaller size, 28–35 cm (11–14 in) total length (including tail), territorial behavior, and reddish fur with a white venter (underbelly). Red squirrels are somewhat larger than chipmunks. The Douglas squirrel is morphologically similar to the American red squirrels, but has a rust-colored venter and is restricted to the southwestern coast of British Columbia and in the Pacific Northwest of the United States. These species' ranges do not overlap. American red squirrels are spontaneous ovulators. Females enter estrus for only one day, but venture from their territory prior to ovulation, and these exploratory forays may serve to advertise their upcoming estrus. On the day of estrus, females are chased by several males in an extended mating chase. Males compete with one another for the opportunity to mate with the estrous female. Estrous females will mate with 4 to 16 males. Gestation has been reported to range from 31 to 35 days. Females can breed for the first time at one year of age, but some females delay breeding until two years of age or older. Most females produce one litter per year, but in some years reproduction is skipped, while in other years some females breed twice. Litter sizes typically range from one to five, but most litters contain three or four offspring. Offspring are pink and hairless at birth and weigh about 10 g. Offspring grow at approximately 1.8 g per day while nursing, and reach adult body size at 125 days. They first emerge from their natal nests at around 42 days, but continue to nurse until approximately 70 days."
}, {
  "id": "1",
  "name": "Eastern Grey Squirrel",
  "image": "https://upload.wikimedia.org/wikipedia/commons/0/0a/Eastern_Grey_Squirrel.jpg",
  "location": "Eastern, Midwestern United States and Central Canada",
  "description": "The eastern gray squirrel has predominantly gray fur, but it can have a brownish color. It has a usual white underside as compared to the typical brownish-orange underside of the fox squirrel. It has a large bushy tail. Particularly in urban situations where the risk of predation is reduced, both white – and black-colored individuals are quite often found. The melanistic form, which is almost entirely black, is predominant in certain populations and in certain geographic areas, such as in large parts of southeastern Canada. Melanistic squirrels appear to exhibit a higher cold tolerance than the common gray morph; when exposed to -10 °C, black squirrels showed an 18% reduction in heat loss, a 20% reduction in basal metabolic rate, and an 11% increase to non-shivering thermogenesis capacity when compared to the common gray morph. Genetic variations within these include individuals with black tails and black-colored squirrels with white tails. (See tree squirrel for more information on these color variations.) The head and body length is from 23 to 30 cm (9.1 to 11.8 in), the tail from 19 to 25 cm (7.5 to 9.8 in), and the adult weight varies between 400 and 600 g (14 and 21 oz). They do not display sexual dimorphism, meaning there is no gender difference in size or coloration. The tracks of an eastern gray squirrel are difficult to distinguish from the related fox squirrel and Abert's squirrel, though the latter's range is almost entirely different from the gray's. Like all squirrels, the eastern gray shows four toes on the front feet and five on the hind feet. The hind foot-pad is often not visible in the track. When bounding or moving at speed, the front foot tracks will be behind the hind foot tracks. The bounding stride can be two to three feet long."
}, {
  "id": "2",
  "name": "Fox Squirrel",
  "image": "https://upload.wikimedia.org/wikipedia/commons/f/fe/Sciurus_niger_%28on_fence%29.jpg",
  "location": "United States and Canada",
  "description": "The squirrel's total body length measures 45 to 70 cm (17.7 to 27.6 in), tail length is 20 to 33 cm (7.9 to 13.0 in), and they range in weight from 500 to 1,000 grams (1.1 to 2.2 lb). There is no sexual dimorphism in size or appearance. Individuals tend to be smaller in the west. There are three distinct geographical phases in coloration: In most areas the animals upper body is brown-grey to brown-yellow with a typically brownish-orange underside, while in eastern regions such as the Appalachians there are more strikingly-patterned dark brown and black squirrels with white bands on the face and tail. In the south can be found isolated communities with uniform black coats. To help with climbing, they have sharp claws, developed extensors of digits and flexors of forearms, and abdominal musculature. Fox squirrels have excellent vision and well-developed senses of hearing and smell. They use scent marking to communicate with other fox squirrels. Fox squirrels also have several sets of vibrissae, hairs or whiskers that are used as touch receptors to sense the environment. These are found above and below their eyes, on their chin and nose, and on each forearm."
}, {
  "id": "3",
  "name": "Red Squirrel",
  "image": "https://upload.wikimedia.org/wikipedia/commons/1/1c/Squirrel_posing.jpg",
  "location": "Northern Europe and Siberia",
  "description": "The red squirrel has a typical head-and-body length of 19 to 23 cm (7.5 to 9 in), a tail length of 15 to 20 cm (6 to 8 in), and a mass of 250 to 340 g (8.8 to 12.0 oz). Males and females are the same size. The red squirrel is somewhat smaller than the eastern grey squirrel which has a head-and-body length of 25 to 30 cm (10 to 12 in) and weighs between 400 and 800 g (14 oz and 1 lb 12 oz).The long tail helps the squirrel to balance and steer when jumping from tree to tree and running along branches, and may keep the animal warm during sleep. The red squirrel, like most tree squirrels, has sharp, curved claws to enable it to climb and descend broad tree trunks, thin branches and even house walls. Its strong hind legs enable it to leap gaps between trees. The red squirrel also has the ability to swim.The coat of the red squirrel varies in colour with time of year and location. There are several different coat colour morphs ranging from black to red. Red coats are most common in Great Britain; in other parts of Europe and Asia different coat colours co-exist within populations, much like hair colour in some human populations. The underside of the squirrel is always white-cream in colour. The red squirrel sheds its coat twice a year, switching from a thinner summer coat to a thicker, darker winter coat with noticeably larger ear-tufts (a prominent distinguishing feature of this species) between August and November. A lighter, redder overall coat colour, along with the ear-tufts (in adults) and smaller size, distinguish the Eurasian red squirrel from the American eastern grey squirrel.["
}]